<a href="https://colab.research.google.com/github/AnandaTryMuhtiga/praktikum-basis-data/blob/main/Bab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

5.2 TEST AWAL â€“ DATA MANIPULATION LANGUAGE (DML)

Tuliskan jawaban berikut pada kertas dengan tulisan tangan, sertakan Nama, NIM, dan Kelas.
1. Bagaimana cara memasukkan data ke tabel? Beri contoh.

Untuk memasukkan data ke dalam tabel digunakan perintah INSERT INTO.

Sintaks:

INSERT INTO Nama_Tabel (kolom1, kolom2, kolom3)
VALUES ('nilai1', 'nilai2', 'nilai3');

Contoh (tabel Mahasiswa):

INSERT INTO Mahasiswa (NIM, Nama, Prodi)
VALUES ('23010201', 'Budi Saputra', 'Informatika');


---

2. Bagaimana cara menghapus data dari tabel? Beri contoh.

Untuk menghapus data digunakan perintah DELETE.

Sintaks:

DELETE FROM Nama_Tabel
WHERE kondisi;

Gunakan WHERE untuk menghindari penghapusan seluruh data.

Contoh:

DELETE FROM Mahasiswa
WHERE NIM = '23010201';


---

5.3 INSERT TABLE

INSERT digunakan untuk memasukkan data ke dalam tabel yang sudah ada.

Sintaks 1 (tanpa menyebut nama field):

INSERT INTO Nama_Table VALUES
(Isi_Field_1, Isi_Field_2, ..., Isi_Field_N);

Sintaks 2 (lebih aman karena menyebut nama kolom):

INSERT INTO Nama_Table
(Nama_Field_1, Nama_Field_2, ..., Nama_Field_N)
VALUES
(Isi_Field_1, Isi_Field_2, ..., Isi_Field_N);

Contoh:

INSERT INTO Mahasiswa VALUES ('05052652', 'Paijo', 'Jalan Wates km 11');


---

5.4 QUERY SEDERHANA (SELECT)

Perintah SELECT digunakan untuk:

Menampilkan seluruh data

Menampilkan kolom tertentu

Menampilkan baris tertentu dengan syarat

Mengurutkan data (ASC/DESC)


5.4.1 Menampilkan Seluruh Data

Sintaks:

SELECT * FROM Nama_Table;

Contoh:

SELECT * FROM Mahasiswa;

5.4.2 Menampilkan Kolom Tertentu

Sintaks:

SELECT Nama_Field_1, Nama_Field_2
FROM Nama_Table;

Contoh:

SELECT NIM, Nama_Mhs
FROM Mahasiswa;

5.4.3 Menampilkan Baris Tertentu (Dengan Kondisi)

Sintaks:

SELECT * FROM Nama_Table
WHERE kondisi;

Contoh:

SELECT NIM, Nama_Mhs
FROM Mahasiswa
WHERE NIM = '05052652';


---

5.5 UPDATE TABLE

UPDATE digunakan untuk mengubah data pada tabel.

Sintaks:

UPDATE Nama_Table
SET Nama_Field = 'Data_Baru'
WHERE Nama_Field_Key = 'Data_Key';

Contoh:

UPDATE customers
SET cust_address = 'Gejayan Yogya',
    cust_country = 'INA'
WHERE cust_id = '10002';


---

5.6 DELETE DATA

DELETE digunakan untuk menghapus data dari tabel.

Sintaks:

DELETE FROM Nama_Table
WHERE Nama_Field_Key = 'Nilai_Key';

Contoh:

DELETE FROM Mhs_2
WHERE ID = '5';

Catatan:
DELETE FROM Nama_Table; tanpa WHERE akan menghapus semua data.


---

5.7 QUERY DENGAN KONDISI

Digunakan untuk mengambil data berdasarkan syarat tertentu.

Sintaks:

SELECT * FROM Nama_Table
WHERE kondisi;

Operator Relasional: =  sama dengan

> lebih besar
<  lebih kecil
= lebih besar atau sama
<= lebih kecil atau sama
<> tidak sama



Contoh 1:

SELECT * FROM customer
WHERE cust_id = '10003' OR cust_name = 'wascals';

Contoh 2:

SELECT prod_name
FROM products
WHERE prod_price >= 20;